enjoyneering/ESP32_WS281x/ESP32_WS281x.cpp
/***************************************************************************************************/
/*
   This is an Arduino library that uses the Espressif ESP32 RMT peripheral to control Adafruit
   NeoPixels, FLORA RGB Smart Pixels, WS2811, WS2812, WS2812B, SK6812, etc.

   written by : enjoyneering
   sourse code: https://github.com/enjoyneering/
   based on:    Adafruit_NeoPixel library v1.12.5

   RMT (Remote Control Peripheral) channels:
   - ESP32 has 8 RMT channels for sending & receiving infrared remote control
     signals. Can be assign to any GPIO pins
   - ESP32-S3 has 4 TX channels (to send) & 4 RX channels (to receive) channels for
     infrared remote control signals. DMA access for TX mode on channel 3 & for RX
     mode on channel 7

   ESP32 strapping pins:
   - GPIO0, internal pull-up
   - GPIO2, internal pull-down
   - GPIO4, internal pull-down
   - GPIO5, internal pull-up
   - GPIO12/MTDI, internal pull-down
   - GPIO15/MTDO, internal pull-up
   - GPIO0, 2, 4 & 15 cannot be used on ESP-WROVER due to external connections
     for PSRAM chip
   - GPIO34..39 input only pins. These pins don’t have internal pull-up or
     pull-down resistors

   Supported frameworks:
   ESP32 Core - https://github.com/espressif/arduino-esp32


   GNU GPL license, all text above must be included in any redistribution,
   see link for details - https://www.gnu.org/licenses/licenses.html
*/
/***************************************************************************************************/

#include "ESP32_WS281x.h"


/************************************************************************************/
/*
   Constructor

   NOTE:
   - constructor when "ledQnt", "dataPin" and "ledPixelType" are known at
     compile-time

   - ledQnt, number of LEDs in strand
   - dataPin  Arduino pin number which will drive the LED data in
   - ledType, pixel type

   - to release RMT resources (RMT channels and "led_data"):
     - call "updateLength(0)" to set number of pixels/bytes to zero
     - then call "show()" to invoke this code and free resources
*/
/************************************************************************************/
ESP32_WS281x::ESP32_WS281x(uint16_t ledQnt, int8_t dataPin, ledPixelType ledType) : _isStarted(false), _brightness(0), _pixels(NULL), _endTime(0)
{
  setPixelType(ledType);  //call before 'setLength()'!!!
  setLength(ledQnt);

  _pin = dataPin;
}


/************************************************************************************/
/*
   Constructor

   NOTE:
   - constructor when "ledQnt", "dataPin" and "ledPixelType" are not known at
     compile-time, and must be initialized later with "setPixelType()",
     "setLength()" and "setPin()"

   - his function is deprecated, here only for old projects that may still be
     calling it. New projects should instead use the constructor
     "ESP32_WS281x(length, pin, type)"
*/
/************************************************************************************/
ESP32_WS281x::ESP32_WS281x() :  _isStarted(false), _pin(-1), _brightness(0), _rOffset(1), _gOffset(0), _bOffset(2), _wOffset(1), _numLEDs(0), _numBytes(0), _pixels(NULL), _endTime(0)
{
  //empty
}


/************************************************************************************/
/*
   Destructor

   Deallocate ESP32_WS281x object, set data pin back to INPUT
*/
/************************************************************************************/
ESP32_WS281x::~ESP32_WS281x()
{
  /* release RMT resources (RMT channels and "led_data") by indirectly calling into "espShow()" */
  memset(_pixels, 0, _numBytes);
  _numLEDs  = 0;
  _numBytes = 0;
  show();

  free(_pixels);

  if (_pin >= 0) {pinMode(_pin, INPUT);}
}


/************************************************************************************/
/*
   begin()

   Configure "ESP32_WS281x" data pin for output
*/
/************************************************************************************/
void ESP32_WS281x::begin()
{
  _isStarted = true; //true if "begin()" called

  setPin(_pin);      //set data pin as output, call after "_isStarted = true"
  espInit();         //initialize mutex
}


/************************************************************************************/
/*
   canShow()

   check whether a call to "show()" will start sending data immediately or will
   'block' for a required interval

   NOTE:
   - LED driver require a short quiet time (about 300 microseconds) after the
     last bit is received before the data 'latches' and new data can start being
     received. Usually one's sketch is implicitly using this time to generate a
     new frame of animation...but if it finishes very quickly, this function
     could be used to see if there's some idle time available for some low-priority
     concurrent task.

   - return true if "show()" will start sending immediately, false if "show()"
     would block (meaning some idle time is available for other tasks)


   - it's normal and possible for "_endTime" to exceed "micros()" if the 32-bit
     clock counter has rolled over (about every 70 minutes). The problem arises
     if code invokes "show()" very infrequently...the "micros()" counter may roll
     over MULTIPLE times in that interval, the delta calculation is no longer correct
     and the next update may stall for a very long time. The check below resets the
     latch counter if a rollover has occurred. This can cause an extra delay of up to
     300 microseconds in the rare case where a "show()" call happens precisely around
     the rollover, but that's neither likely nor especially harmful, vs. other code 
     that might stall for 30+ minutes, or having to document and frequently remind
     and/or provide tech support explaining an unintuitive need for "show()" calls at
     least once an hour
*/
/************************************************************************************/ 
bool ESP32_WS281x::canShow()
{
  uint32_t now = micros();

  if (_endTime > now) {_endTime = now;}

  return (now - _endTime) >= 300L; //300 microseconds
}


/**************************************************************************/
/*
   show()

   Transmit pixel data in RAM to LED drivers

