enjoyneering/ESP32_WS281x/ESP32_WS281x.cpp
   NOTE:
   - ESP32 may not disable interrupts because "espShow()" uses RMT which tries
     to acquire locks

   - data latch = 300+ microsecond pause in the output stream. Rather than
     put a delay at the end of the function, the ending time is noted and
     the function will simply hold off (if needed) on issuing the
     subsequent round of data until the latch time has elapsed. This
     allows the mainline code to start generating the next frame of data
     rather than stalling for the latch.

   - "_endTime" is a private member (rather than global var) so that
     multiple class instances on different pins can be quickly issued in
     succession (each instance doesn't delay the next)
*/
/**************************************************************************/ 
void ESP32_WS281x::show()
{
  if (!_pixels) {return;}

//while (canShow() != true){//empty}  //see NOTE
  while (canShow() != true){yield();} //see NOTE

  espShow(_pin, _pixels, _numBytes);

  _endTime = micros(); // Save EOD time for latch on next call
}


/************************************************************************************/
/*
   setPin()

   Set (change) "ESP32_WS281x" output pin number on the fly

   NOTE:
   - previous pin (if any) is set to INPUT and the new pin is set to OUTPUT
   - Arduino pin number -1=no pin
*/
/************************************************************************************/
void ESP32_WS281x::setPin(int8_t dataPin)
{
  if ((_isStarted == true) && (_pin >= 0)) {pinMode(_pin, INPUT);} //disable existing data output pin

  _pin = dataPin;

  if (_isStarted == true)
  {
    pinMode(_pin, OUTPUT);
    digitalWrite(_pin, LOW);
  }
}


/************************************************************************************/
/*
   getPin()

   Retrieve pin number used for "ESP32_WS281x" data output

   NOTE:
   - return pin number -1 if not set
*/
/************************************************************************************/
const int8_t ESP32_WS281x::getPin()
{
  return _pin;
}


/************************************************************************************/
/*
   setBrightness()

   Adjust output brightness. Does not immediately affect what's currently displayed
   on the LEDs. The next call to "show()" will refresh the LEDs at this level.

   NOTE:
   - brightness setting 0..255 (minimum/off to full brightest)
   - this was intended for one-time use in one's setup() function not as an
     animation effect in itself. Because of the way this library "pre-multiplies"
     LED colors in RAM, changing the brightness is often a "lossy" operation what
     you write to pixels isn't necessary the same as what you'll read back.


   - stored brightness value is different than what's passed. This simplifies the
     actual scaling math later, allowing a fast 8x8-bit multiply and taking the
     MSB. 'brightness' is a uint8_t, adding 1 here may (intentionally) roll over...
     so 0 = max brightness (color values are interpreted literally; no scaling),
     1 = min brightness (off), 255 = just below max brightness.

   - re-scale brightness existing data in RAM is potentially "lossy" process
     especially when increasing brightness. The tight timing in the WS2811/WS2812
     code means there aren't enough free cycles to perform this scaling on the fly
     as data is issued. So we make a pass through the existing color data in RAM and
     scale it (subsequent graphics commands also work at this brightness level). If
     there's a significant step up in brightness, the limited number of steps
     (quantization) in the old data will be quite visible in the re-scaled version.
     For a non-destructive change, you'll need to re-render the full strip data.
     C'est la vie.
*/
/************************************************************************************/
void ESP32_WS281x::setBrightness(uint8_t brightness)
{

  uint8_t newBrightness = brightness + 1; //see NOTE

  if (newBrightness != _brightness) //see NOTE
  {
    uint8_t  c            = 0;
    uint8_t* ptr          = _pixels;
    uint8_t oldBrightness = _brightness - 1; //de-wrap old "_brightness" value
    uint16_t scale        = 0;

    if      (oldBrightness == 0) {scale = 0;}                     //avoid /0
    else if (brightness == 255)  {scale = 65535 / oldBrightness;}
    else                         {scale = (((uint16_t)newBrightness << 8) - 1) / oldBrightness;}

    for (uint16_t i = 0; i < _numBytes; i++)
    {
      c      = *ptr;
      *ptr++ = (c * scale) >> 8;
    }

    _brightness = newBrightness;
  }
}

/************************************************************************************/
/*
   getBrightness()

   Retrieve the last-set brightness value for the LED drivers strip

   NOTE:
   - return 0..255 (minimum/off to full brightest)
*/
/************************************************************************************/
const uint8_t ESP32_WS281x::getBrightness()
{
  return (_brightness - 1);
}


/************************************************************************************/
/*
   setLength()

   Change the length of a previously-declared "ESP32_WS281x" strip object. Old data
   is deallocated and new data is cleared, pin number and pixel format are unchanged

   NOTE:
   - ledQnt, new length of strip, in pixels

   - his function is deprecated, here only for old projects that may still be
     calling it. New projects should instead use the constructor
     "ESP32_WS281x(length, pin, type)"
*/
/************************************************************************************/
void ESP32_WS281x::setLength(uint16_t ledQnt)
{
  free(_pixels); //free existing data, if any

  _numBytes = ledQnt * ((_wOffset == _rOffset) ? 3 : 4); //recalculate size of "_pixels" buffer, ALL PIXELS ARE CLEARED

  if ((_pixels = (uint8_t *)malloc(_numBytes)) != NULL)
  {
    memset(_pixels, 0, _numBytes);

    _numLEDs = ledQnt;
  }
  else
  {
    _numLEDs  = 0;
    _numBytes = 0;
  }
}


