enjoyneering/ESP32_WS281x/ESP32_WS281x.cpp
/************************************************************************************/
/*
   getLength()

   Return the number of pixels/LEDs in an "ESP32_WS281x" strip object

   NOTE:
   - return pixel count (quantity), 0 if not set
*/
/************************************************************************************/
const uint16_t ESP32_WS281x::getLength()
{
  return _numLEDs;
}


/************************************************************************************/
/*
   setPixelType()

   Change pixel format of a previously-declared "ESP32_WS281x" strip object.

   NOTE:
   - if format changes from one of the RGB variants to an RGBW variant
     (or RGBW to RGB), the old data will be deallocated and new data is cleared.
     Otherwise, the old data will remain in RAM and is not reordered to the new
     format, so it's advisable to follow up with clear()

   - his function is deprecated, here only for old projects that may still be
     calling it. New projects should instead use the constructor
     "ESP32_WS281x(length, pin, type)"
*/
/************************************************************************************/
void ESP32_WS281x::setPixelType(ledPixelType ledType)
{
  bool oldThreeBytesPerPixel = (_wOffset == _rOffset); //false if RGBW

  _wOffset = (ledType >> 6) & 0b11; //see notes in header file
  _rOffset = (ledType >> 4) & 0b11; //regarding R/G/B/W offsets
  _gOffset = (ledType >> 2) & 0b11;
  _bOffset = (ledType & 0b11);

  //if bytes-per-pixel has changed (and pixel data was previously allocated), re-allocate to new size will clear any data
  if (_pixels != NULL)
  {
    bool newThreeBytesPerPixel = (_wOffset == _rOffset);

    if (newThreeBytesPerPixel != oldThreeBytesPerPixel) {setLength(_numLEDs);}
  }
}


/************************************************************************************/
/*
   strToPixelType()

   Convert pixel color order from string (e.g. "BGR") to "ESP32_WS281x"
   color order constant (e.g. LED_BGR). This may be helpful for code
   that initializes from text configuration rather than compile-time
   constants

   NOTE:
   - strValue, input string. Should be reasonably sanitized (a 3..4 character
     NUL-terminated string) or undefined behavior may result (output is still a
     valid "ESP32_WS281x" order constant, but might not present as expected).
     Garbage in, garbage out

   - return "ESP32_WS281x" color order constants (e.g. LED_BGR)

   - this function is declared static in the class so it can be called without a
     "ESP32_WS281x" object (since it's not likely been declared in the code yet).
     Use "ESP32_WS281x::str2order()"
*/
/************************************************************************************/
ledPixelType ESP32_WS281x::strToPixelType(const char *strValue)
{
  int8_t r = 0, g = 0, b = 0, w = -1;

  if (strValue)
  {
    char c;

    for (uint8_t i=0; ((c = tolower(strValue[i]))); i++)
    {
      if      (c == 'r') {r = i;}
      else if (c == 'g') {g = i;}
      else if (c == 'b') {b = i;}
      else if (c == 'w') {w = i;}
    }

    r &= 3;
  }

  if (w < 0) w = r; //if 'w' not specified, duplicate r bits

  return (w << 6) | (r << 4) | ((g & 3) << 2) | (b & 3);
}


/************************************************************************************/
/*
   setPixelColor()

   Set a pixel's color using separate red(R), green(G) and blue(G) components in RAM

   NOTE:
   - if using RGBW pixels, white will be set to 0(off)
   - 0b00RRGGBB for RGB LED drivers
   - 0bWWRRGGBB for RGBW LED drivers

   - ledIndex, pixel index starting from 0
   - r, red  brightness 0..255 (minimum/off to maximum)
   - g, green brightness 0..255 (minimum/off to maximum)
   - b, blue brightness 0..255 (minimum/off to maximum)
*/
/************************************************************************************/
void ESP32_WS281x::setPixelColor(uint16_t ledIndex, uint8_t r, uint8_t g, uint8_t b)
{
  if (ledIndex < _numLEDs)
  {
    if (_brightness) //see notes in "setBrightness()", strip brightness 0..255 (stored as +1, e.g. 1..256)
    {
      r = (r * _brightness) >> 8;
      g = (g * _brightness) >> 8;
      b = (b * _brightness) >> 8;
    }

    uint8_t *p;

    if (_wOffset == _rOffset)   //RGB-type strip, 3-bytes per pixel
    {
      p = &_pixels[ledIndex * 3]; //3-bytes per pixel (ignore W)
    }
    else                        //WRGB-type strip, 4-bytes per pixel
    {
      p = &_pixels[ledIndex * 4]; //4-bytes per pixel

      p[_wOffset] = 0;          //set W to 0, only R,G,B passed
    }

    p[_rOffset] = r; //store R,G,B
    p[_gOffset] = g;
    p[_bOffset] = b;
  }
}


/************************************************************************************/
/*
   setPixelColor()

   Set a pixel's color using separate red(R), green(G), blue(G) and white(W)
   components in RAM (for RGBW LED drivers only)

   NOTE:
   - if using RGB pixels, white will be ignored
   - 0bxxRRGGBB for RGB LED drivers
   - 0bWWRRGGBB for RGBW LED drivers

   - ledIndex, pixel index starting from 0
   - r, red  brightness 0..255 (minimum/off to maximum)
   - g, green brightness 0..255 (minimum/off to maximum)
   - b, blue brightness 0..255 (minimum/off to maximum)
   - w, white brightness 0..255 (minimum/off to maximum)
*/
/************************************************************************************/
void ESP32_WS281x::setPixelColor(uint16_t ledIndex, uint8_t r, uint8_t g, uint8_t b, uint8_t w)
{
  if (ledIndex < _numLEDs)
  {
    if (_brightness) //see note in "setBrightness()", strip brightness 0..255 (stored as +1, e.g. 1..256)
    {
      r = (r * _brightness) >> 8;
      g = (g * _brightness) >> 8;
      b = (b * _brightness) >> 8;
      w = (w * _brightness) >> 8;
    }

    uint8_t *p;

    if (_wOffset == _rOffset)   //RGB-type strip, 3-bytes per pixel
    {
      p = &_pixels[ledIndex * 3]; //3-bytes per pixel (ignore W)
    }
    else                        //WRGB-type strip, 4-bytes per pixel
    {
      p = &_pixels[ledIndex * 4]; //4-bytes per pixel

      p[_wOffset] = w;          //store W
    }

    p[_rOffset] = r; //store R,G,B
    p[_gOffset] = g;
    p[_bOffset] = b;
  }
}


