enjoyneering/ESP32_WS281x/ESP32_WS281x.cpp
/************************************************************************************/
/*
   setPixelColor()

   NOTE:
   Set a pixel's color using a 32-bit 'packed' RGB or RGBW value

   NOTE:
   - ledIndex, Pixel index starting from 0
   - color, 32-bit color value. Most significant byte is white (for RGBW
     pixels) or ignored (for RGB pixels), next is red, then green, and least
     significant byte is blue

   - 0bxxRRGGBB for RGB LED drivers
   - 0bWWRRGGBB for RGBW LED drivers
*/
/************************************************************************************/
void ESP32_WS281x::setPixelColor(uint16_t ledIndex, uint32_t color)
{
  if (ledIndex < _numLEDs)
  {
    uint8_t *p;

    uint8_t r = (uint8_t)(color >> 16);
    uint8_t g = (uint8_t)(color >> 8);
    uint8_t b = (uint8_t)color;

    if (_brightness) //see note in 'setBrightness()', strip brightness 0..255 (stored as +1, e.g. 1..256)
    {
      r = (r * _brightness) >> 8;
      g = (g * _brightness) >> 8;
      b = (b * _brightness) >> 8;
    }

    if (_wOffset == _rOffset)    //RGB-type strip, 3-bytes per pixel
    {
      p = &_pixels[ledIndex * 3];
    }
    else                         //WRGB-type strip, 4-bytes per pixel
    {
      p  = &_pixels[ledIndex * 4];

      uint8_t w  = (uint8_t)(color >> 24);

      p[_wOffset] = _brightness ? ((w * _brightness) >> 8) : w; //store W
    }

    p[_rOffset] = r; //store R,G,B
    p[_gOffset] = g;
    p[_bOffset] = b;
  }
}


/************************************************************************************/
/*
  getPixelColor()

  Get the color of a previously-set pixel

  NOTE:
   - stored color was decimated by "setBrightness()". Returned value attempts to
     scale back to an approximation of the original 24-bit value used when setting
     the pixel color, but there will always be some error (those bits are simply
     gone). Issue is most happend at low brightness levels

  - ledIndex, index of pixel to read (0=first)

  - return 'packed' 32-bit RGB or WRGB value. Most significant byte is white
           (for RGBW pixels) or 0 (for RGB pixels), next is red, then green,
           and least significant byte is blue

  - 0b00RRGGBB for RGB LED drivers
  - 0bWWRRGGBB for RGBW LED drivers
*/
/************************************************************************************/
const uint32_t ESP32_WS281x::getPixelColor(uint16_t ledIndex)
{
  if (ledIndex >= _numLEDs) {return 0;} //out of bounds, return no color

  uint8_t* p;

  if (_wOffset == _rOffset) //RGB-type strip, 3-bytes per pixel
  {
    p = &_pixels[ledIndex * 3];

    if (_brightness)        //see note in 'setBrightness()', strip brightness 0..255 (stored as +1, e.g. 1..256)
    {
      return (((uint32_t)(p[_rOffset] << 8) / _brightness) << 16) |
             (((uint32_t)(p[_gOffset] << 8) / _brightness) << 8)  |
              ((uint32_t)(p[_bOffset] << 8) / _brightness);
    }
    else                    //no "_brightness" adjustment has been made, return 'raw' color
    {

      return ((uint32_t)p[_rOffset] << 16) | ((uint32_t)p[_gOffset] << 8) | (uint32_t)p[_bOffset];
    }
  }
  else                      //WRGB-type strip, 4-bytes per pixel
  {
    p = &_pixels[ledIndex * 4];

    if (_brightness)        //return scaled color
    {
      return (((uint32_t)(p[_wOffset] << 8) / _brightness) << 24) |
             (((uint32_t)(p[_rOffset] << 8) / _brightness) << 16) |
             (((uint32_t)(p[_gOffset] << 8) / _brightness) << 8)  |
              ((uint32_t)(p[_bOffset] << 8) / _brightness);
    }
    else                    //no "_brightness" adjustment has been made, return 'raw' color
    {
      return ((uint32_t)p[_wOffset] << 24) | ((uint32_t)p[_rOffset] << 16) | ((uint32_t)p[_gOffset] << 8)  | (uint32_t)p[_bOffset];
    }
  }
}


/************************************************************************************/
/*
   getRibbonColor()

   Get a pointer directly to "ESP32_WS281x" data buffer in RAM

   NOTE:
   - this is for high-performance applications where calling "setPixelColor()" on
     every single pixel would be too slow (e.g. POV or light-painting projects).
     There is no bounds checking on the array, creating tremendous potential for
     mayhem if one writes past the ends of the buffer. Great power, great
     responsibility and all that

   - pixel data is stored in a device-native format ("ledPixelType" format) and is
     not translated here. Applications that access this buffer will need to be
     aware of the specific data format and handle colors appropriately

   - [0bxxRRGGBB,..,0bxxRRGGBB] array for RGB LED drivers
   - [0bWWRRGGBB,..,0bxxRRGGBB] array for RGBW LED drivers

   - return pointer to "ESP32_WS281x" buffer (uint8_t* array)
*/
/************************************************************************************/
const uint8_t* ESP32_WS281x::getRibbonColor()
{
  return _pixels;
}


/************************************************************************************/
/*
   fill()

   Fill all or part of the "ESP32_WS281x" data buffer in RAM with a color

   NOTE:
   - color, 32-bit color value. Most significant byte is white (for RGBW pixels) or 
     ignored (for RGB pixels), next is red, then green, and least significant byte
     is blue. If all arguments are unspecified, this will be 0 (off)

   - ledIndex, Index of first pixel to fill starting from 0. Must be in-bounds, no 
     clip_ping is performed. 0 if unspecified.
   - numOfLEDs, umber of pixels to fill, as a positive value. Passing 0 or leaving
     unspecified will fill to end of strip.
*/
/************************************************************************************/
void ESP32_WS281x::fill(uint32_t color, uint16_t ledIndex, uint16_t numOfLEDs)
{
  if (ledIndex >= _numLEDs) {return;} //if ledIndex LED is past end of strip, nothing to do

  uint16_t end;

  //calculate index ONE AFTER the last pixel to fill
  if (numOfLEDs == 0)
  {
    end = _numLEDs;          //fill to end of strip
  }
  else                       //ensure that the loop won't go past the last pixel
  {
    end = ledIndex + numOfLEDs;

    if (end > _numLEDs) {end = _numLEDs;}
  }

