enjoyneering/ESP32_WS281x/ESP32_WS281x.cpp
  for (uint16_t i = ledIndex; i < end; i++)
  {
    this->setPixelColor(i, color);
  }
}


/************************************************************************************/
/*
   rainbow()

   Fill LED strip with one or more cycles of hues. Everyone loves the rainbow
   swirl so much, now it's canon!

   NOTE:
   - firstHue, hue of first pixel 0..65535, representing one full cycle of the
     color wheel. Each subsequent pixel will be offset to complete one or more
     cycles over the length of the strip
   - reps, number of cycles of the color wheel over the length of the strip. 
     Default is 1. Negative values can be used to reverse the hue order
   - saturation, (optional)  0..255 (gray to pure hue). Defaul 255
   - brightness, (optional) 0..255 (off to max). Ddefault 255
   - gammify, if true (default), apply gamma correction to colors for better
     appearance
*/
/************************************************************************************/
void ESP32_WS281x::rainbow(uint16_t firstHue, int8_t reps, uint8_t saturation, uint8_t _brightness, bool gammify)
{
  for (uint16_t i=0; i < _numLEDs; i++)
  {
    uint16_t hue = firstHue + (i * reps * 65536) / _numLEDs;

    uint32_t color = colorHSV(hue, saturation, _brightness);

    if (gammify) color = gamma32(color);

    setPixelColor(i, color); //refresh pixel color buffer
  }
}


/************************************************************************************/
/*
   clear()

   Fill the whole LED strip data buffer in RAM with 0/black/off
*/
/************************************************************************************/
void ESP32_WS281x::clear()
{ 
  memset(_pixels, 0, _numBytes);
}


/************************************************************************************/
/*
   color()

   Convert separate red(R), green(G) and blue(B) values into a single
   "packed" 32-bit RGB color

   NOTE:
   - r, red brightness 0..255
   - g, green brightness 0..255
   - b, blue brightness 0..255

   - return 32-bit packed RGB value, which can then be assigned to a variable for
     later use or passed to the "setPixelColor()" function. Packed RGB format is
     predictable, regardless of LED strand color order
*/
/************************************************************************************/
uint32_t ESP32_WS281x::color(uint8_t r, uint8_t g, uint8_t b)
{
  return ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
}


/************************************************************************************/
/*
   color()

   Convert separate red(R), green(G), blue(B) and white(W) values into a single
   "packed" 32-bit RGB color WRGB color

   NOTE:
   - r, red brightness 0..255
   - g, green brightness 0..255
   - b, blue brightness 0..255
   - w, white brightness 0..255

   - return 32-bit packed WRGB value, which can then be assigned to a variable for
     later use or passed to the "setPixelColor()" function. Packed WRGB format is
     predictable, regardless of LED strand color order
*/
/************************************************************************************/
uint32_t ESP32_WS281x::color(uint8_t r, uint8_t g, uint8_t b, uint8_t w)
{
    return ((uint32_t)w << 24) | ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
}


/************************************************************************************/
/*
   colorHSV()

   Convert hue, saturation and value into a packed 32-bit RGB color that can be
   passed to "setPixelColor()" or other RGB-compatible functions

   NOTE:
   - hue, unsigned 16-bit value 0..65535, representing one full loop of the color
     wheel, which allows 16-bit hues to "roll over" while still doing the expected
     thing (and allowing more precision than the "wheel()" function that was common
     to prior "ESP32_WS281x" examples)
   - sat, saturation 8-bit value 0..255 (min/pure grayscale to max/pure hue)
     Default of 255 if unspecified
   - brightness, 8-bit value 0..255 (min/black/off to max/full brightness)
     Default of 255 if unspecified

   - result is linearly but not perceptually correct, so you may want to pass the
     result through the "gamma32()" function (or your own gamma-correction operation)
     else colors may appear washed out. Diffusing the LEDs also really seems to help
     when using low-saturation colors

   - returned packed 32-bit RGB with the most significant byte set to 0 (the
     white element of WRGB pixels is NOT utilized)
*/
/************************************************************************************/
uint32_t ESP32_WS281x::colorHSV(uint16_t hue, uint8_t sat, uint8_t brightness)
{
  uint8_t r;
  uint8_t g;
  uint8_t b;

  /*
     Remap 0-65535 to 0-1529. Pure red is CENTERED on the 64K rollover;
     0 is not the start of pure red, but the midpoint...a few values above
     zero and a few below 65536 all yield pure red (similarly, 32768 is the
     midpoint, not start, of pure cyan). The 8-bit RGB hexcone (256 values
     each for red, green, blue) really only allows for 1530 distinct hues
     (not 1536, more on that below), but the full unsigned 16-bit type was
     chosen for hue so that one's code can easily handle a contiguous color
     wheel by allowing hue to roll over in either direction
  */
  hue = (hue * 1530L + 32768) / 65536;

  /*
     Because red is centered on the rollover point (the +32768 above,
     essentially a fixed-point +0.5), the above actually yields 0 to 1530,
     where 0 and 1530 would yield the same thing. Rather than apply a
     costly modulo operator, 1530 is handled as a special case below
  */

  /*
     So you'd think that the color "hexcone" (the thing that ramps from
     pure red, to pure yellow, to pure green and so forth back to red,
     yielding six slices), and with each color component having 256
     possible values (0-255), might have 1536 possible items (6*256),
     but in reality there's 1530. This is because the last element in
     each 256-element slice is equal to the first element of the next
     slice, and kee_ping those in there this would create small
     discontinuities in the color wheel. So the last element of each
     slice is dropped...we regard only elements 0-254, with item 255
     being picked up as element 0 of the next slice. Like this:
     Red to not-quite-pure-yellow is:        255,   0, 0 to 255, 254,   0
     Pure yellow to not-quite-pure-green is: 255, 255, 0 to   1, 255,   0
     Pure green to not-quite-pure-cyan is:     0, 255, 0 to   0, 255, 254
     and so forth. Hence, 1530 distinct hues (0 to 1529), and hence why
     the constants below are not the multiples of 256 you might expect
  */

  //convert hue to R,G,B (nested ifs faster than divide+mod+switch):
  if (hue < 510)       //red to green-1
  {
    b = 0;
    if (hue < 255)     //red to yellow-1
    {
      r = 255;
      g = hue;         //g = 0 to 254
    } 
    else               //yellow to green-1
    {
      r = 510 - hue;   //r = 255 to 1
      g = 255;
    }
  }
  else if (hue < 1020) //green to blue-1
  {
    r = 0;
    if (hue < 765)     //green to cyan-1
    {
      g = 255;
      b = hue - 510;   //b = 0 to 254
    }
    else               //cyan to blue-1
    {
      g = 1020 - hue;  //g = 255 to 1
      b = 255;
    }
  }
  else if (hue < 1530) //blue to red-1
  {
    g = 0;
    if (hue < 1275)    //blue to magenta-1
    {
      r = hue - 1020;  //r = 0 to 254
      b = 255;
    }
    else               //magenta to red-1
    {
      r = 255;
      b = 1530 - hue;  //b = 255 to 1
    }
  }
  else                 //last 0.5 red (quicker than % operator)
  {
    r = 255;
    g = b = 0;
  }

  //apply saturation and brightness to R,G,B, pack into 32-bit result
  uint32_t v1 = 1 + brightness; //1..256, allows >>8 instead of /255
  uint16_t s1 = 1 + sat;        // 1..256, same reason
  uint8_t  s2 = 255 - sat;      //255..0

  return ((((((r * s1) >> 8) + s2) * v1) & 0xff00) << 8) |
          (((((g * s1) >> 8) + s2) * v1) & 0xff00) |
          (((((b * s1) >> 8) + s2) * v1) >> 8);
}


