enjoyneering/ESP32_WS281x/ESP32_WS281x.cpp
/************************************************************************************/
/*
   gamma8()

   An 8-bit gamma-correction function for basic pixel brightnessadjustment. Makes
   color transitions appear more perceptially correct

   NOTE:
   - colorValue, input brightness 0..255 (minimum or off/black to maximum).
   - return gamma-adjusted brightness, can then be passed to one of the
     "setPixelColor()" functions. This uses a fixed gamma correction exponent
     of 2.6, which seems reasonably okay for average LED drivers in average tasks.
     If you need finer control you'll need to provide your own gamma-correction
     function instead
*/
/************************************************************************************/
uint8_t ESP32_WS281x::gamma8(uint8_t colorValue)
{
  return pgm_read_byte(&_ledPixelGammaTable[colorValue]); // 0..255 in, 0..255 out
}


/************************************************************************************/
/*
   gamma32()

   32-bit variant of "gamma8()" that applies the same function to all components
   of a packed RGB or WRGB value. Makes color transitions appear more perceptially
   correct

   NOTE:
   - colorValue, 32-bit packed RGB or WRGB color

   - return  gamma-adjusted packed color, can then be passed in one of the
     "setPixelColor()" functions. Like "gamma8()", this uses a fixed gamma correction 
     exponent of 2.6, which seems reasonably okay for average LED drivers in average
     tasks. If you need finer control you'll need to provide your own gamma-correction
     function instead

   - all four bytes of a 32-bit value are filtered even if RGB (not WRGB), to avoid
     a bunch of shifting and masking that would be necessary for properly handling
     different endianisms (and each byte is a fairly trivial operation, so it might
     not even be wasting cycles vs a check and branch for the RGB case). In theory
     this might cause trouble *if* someone's storing information in the unused most
     significant byte of an RGB value, but this seems exceedingly rare and if it's
     encountered in reality they can mask values going in or coming out
*/
/************************************************************************************/
uint32_t ESP32_WS281x::gamma32(uint32_t colorValue)
{
  uint8_t *y = (uint8_t *)&colorValue;

  for (uint8_t i = 0; i < 4; i++)
  {
    y[i] = gamma8(y[i]);
  }

  return colorValue; //packed 32-bit return
}